{
    "name": "Ranger",
    "description": "A warrior who uses martial prowess and nature magic to combat threats on the edges of civilization.",
    "hit_dice": "1d10",
    "primary_ability": ["dexterity", "wisdom"],
    "saving_throw_proficiencies": ["strength", "dexterity"],
    "armor_proficiencies": [
        "light armor",
        "medium armor",
        "shields"
    ],
    "weapon_proficiencies": [
        "simple weapons",
        "martial weapons"
    ],
    "skill_proficiencies": {
        "choose": 3,
        "from": [
            "animal handling",
            "athletics",
            "insight",
            "investigation",
            "nature",
            "perception",
            "stealth",
            "survival"
        ]
    },
    "starting_equipment": {
        "choices": [
            {
                "choose": 1,
                "from": [
                    ["scale mail"],
                    ["leather armor"]
                ]
            },
            {
                "choose": 1,
                "from": [
                    ["two shortswords"],
                    ["two simple melee weapons"]
                ]
            },
            {
                "choose": 1,
                "from": [
                    ["dungeoneer's pack"],
                    ["explorer's pack"]
                ]
            }
        ],
        "default": [
            "longbow",
            "quiver of 20 arrows"
        ]
    },
    "features": {
        "1": [
            {
                "name": "Favored Enemy",
                "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.",
                "choose": {
                    "count": 1,
                    "from": [
                        {
                            "name": "Aberrations",
                            "description": "You gain advantage on Wisdom (Survival) checks to track aberrations, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Beasts",
                            "description": "You gain advantage on Wisdom (Survival) checks to track beasts, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Celestials",
                            "description": "You gain advantage on Wisdom (Survival) checks to track celestials, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Constructs",
                            "description": "You gain advantage on Wisdom (Survival) checks to track constructs, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Dragons",
                            "description": "You gain advantage on Wisdom (Survival) checks to track dragons, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Elementals",
                            "description": "You gain advantage on Wisdom (Survival) checks to track elementals, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Fey",
                            "description": "You gain advantage on Wisdom (Survival) checks to track fey, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Fiends",
                            "description": "You gain advantage on Wisdom (Survival) checks to track fiends, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Giants",
                            "description": "You gain advantage on Wisdom (Survival) checks to track giants, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Monstrosities",
                            "description": "You gain advantage on Wisdom (Survival) checks to track monstrosities, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Oozes",
                            "description": "You gain advantage on Wisdom (Survival) checks to track oozes, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Plants",
                            "description": "You gain advantage on Wisdom (Survival) checks to track plants, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Undead",
                            "description": "You gain advantage on Wisdom (Survival) checks to track undead, as well as on Intelligence checks to recall information about them."
                        },
                        {
                            "name": "Humanoids (Gnolls and Orcs)",
                            "description": "You gain advantage on Wisdom (Survival) checks to track gnolls and orcs, as well as on Intelligence checks to recall information about them."
                        }
                    ]
                }
            },
            {
                "name": "Natural Explorer",
                "description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark.",
                "choose": {
                    "count": 1,
                    "from": [
                        {
                            "name": "Arctic",
                            "description": "You are particularly familiar with arctic terrain and are adept at traveling and surviving in such regions."
                        },
                        {
                            "name": "Coast",
                            "description": "You are particularly familiar with coastal terrain and are adept at traveling and surviving in such regions."
                        },
                        {
                            "name": "Desert",
                            "description": "You are particularly familiar with desert terrain and are adept at traveling and surviving in such regions."
                        },
                        {
                            "name": "Forest",
                            "description": "You are particularly familiar with forest terrain and are adept at traveling and surviving in such regions."
                        },
                        {
                            "name": "Grassland",
                            "description": "You are particularly familiar with grassland terrain and are adept at traveling and surviving in such regions."
                        },
                        {
                            "name": "Mountain",
                            "description": "You are particularly familiar with mountain terrain and are adept at traveling and surviving in such regions."
                        },
                        {
                            "name": "Swamp",
                            "description": "You are particularly familiar with swamp terrain and are adept at traveling and surviving in such regions."
                        },
                        {
                            "name": "Underdark",
                            "description": "You are particularly familiar with Underdark terrain and are adept at traveling and surviving in such regions."
                        }
                    ]
                }
            }
        ],
        "2": [
            {
                "name": "Fighting Style",
                "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options:",
                "choose": {
                    "count": 1,
                    "from": [
                        {
                            "name": "Archery",
                            "description": "You gain a +2 bonus to attack rolls you make with ranged weapons."
                        },
                        {
                            "name": "Defense",
                            "description": "While you are wearing armor, you gain a +1 bonus to AC."
                        },
                        {
                            "name": "Dueling",
                            "description": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
                        },
                        {
                            "name": "Two-Weapon Fighting",
                            "description": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
                        }
                    ]
                }
            },
            {
                "name": "Spellcasting",
                "description": "You have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list."
            }
        ],
        "3": [
            {
                "name": "Ranger Conclave",
                "description": "You choose to emulate the ideals and training of a ranger conclave. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level.",
                "choose": {
                    "count": 1,
                    "from": [
                        {
                            "name": "Hunter",
                            "description": "Emulating the Hunter archetype means accepting your place as a bulwark between civilization and the terrors of the wilderness."
                        },
                        {
                            "name": "Beast Master",
                            "description": "The Beast Master archetype embodies a friendship between the civilized races and the beasts of the world."
                        },
                        {
                            "name": "Horizon Walker",
                            "description": "Horizon Walkers guard the world against threats that originate from other planes or that seek to ravage the mortal realm with otherworldly magic."
                        }
                    ]
                }
            },
            {
                "name": "Primeval Awareness",
                "description": "You can use your action and expend a spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead."
            }
        ],
        "4": [
            {
                "name": "Ability Score Improvement",
                "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature."
            }
        ],
        "5": [
            {
                "name": "Extra Attack",
                "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
            }
        ],
        "6": [
            {
                "name": "Favored Enemy and Natural Explorer improvements",
                "description": "You choose one additional favored enemy, as well as one additional favored terrain."
            }
        ],
        "7": [
            {
                "name": "Ranger Conclave feature",
                "description": "You gain a feature from your Ranger Conclave."
            }
        ],
        "8": [
            {
                "name": "Ability Score Improvement",
                "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature."
            },
            {
                "name": "Land's Stride",
                "description": "Moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard."
            }
        ],
        "10": [
            {
                "name": "Hide in Plain Sight",
                "description": "You can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions."
            }
        ],
        "11": [
            {
                "name": "Ranger Conclave feature",
                "description": "You gain a feature from your Ranger Conclave."
            }
        ],
        "12": [
            {
                "name": "Ability Score Improvement",
                "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature."
            }
        ],
        "14": [
            {
                "name": "Favored Enemy improvement",
                "description": "You choose one additional favored enemy."
            },
            {
                "name": "Vanish",
                "description": "You can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."
            }
        ],
        "15": [
            {
                "name": "Ranger Conclave feature",
                "description": "You gain a feature from your Ranger Conclave."
            }
        ],
        "16": [
            {
                "name": "Ability Score Improvement",
                "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature."
            }
        ],
        "18": [
            {
                "name": "Feral Senses",
                "description": "You gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened."
            }
        ],
        "19": [
            {
                "name": "Ability Score Improvement",
                "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature."
            }
        ],
        "20": [
            {
                "name": "Foe Slayer",
                "description": "You become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
            }
        ]
    },
    "spellcasting": {
        "ability": "wisdom",
        "focus": ["druidic focus", "component_pouch"],
        "spells_known": {
            "1": 0,
            "2": 2,
            "3": 3,
            "4": 3,
            "5": 4,
            "6": 4,
            "7": 5,
            "8": 5,
            "9": 6,
            "10": 6,
            "11": 7,
            "12": 7,
            "13": 8,
            "14": 8,
            "15": 9,
            "16": 9,
            "17": 10,
            "18": 10,
            "19": 11,
            "20": 11
        },
        "spell_slots_per_level": {
            "1": {},
            "2": {
                "1": 2
            },
            "3": {
                "1": 3
            },
            "4": {
                "1": 3
            },
            "5": {
                "1": 4,
                "2": 2
            },
            "6": {
                "1": 4,
                "2": 2
            },
            "7": {
                "1": 4,
                "2": 3
            },
            "8": {
                "1": 4,
                "2": 3
            },
            "9": {
                "1": 4,
                "2": 3,
                "3": 2
            },
            "10": {
                "1": 4,
                "2": 3,
                "3": 2
            },
            "11": {
                "1": 4,
                "2": 3,
                "3": 3
            },
            "12": {
                "1": 4,
                "2": 3,
                "3": 3
            },
            "13": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 1
            },
            "14": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 1
            },
            "15": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 2
            },
            "16": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 2
            },
            "17": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 3,
                "5": 1
            },
            "18": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 3,
                "5": 1
            },
            "19": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 3,
                "5": 2
            },
            "20": {
                "1": 4,
                "2": 3,
                "3": 3,
                "4": 3,
                "5": 2
            }
        }
    },
    "subclass_level": 3,
    "version": "5E",
    "source": "PHB",
    "source_page": 89
} 