{
    "cantrips": [
        {
            "name": "Blade Ward",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "1 round",
            "description": "You extend your hand and trace a sigil of warding in the air. Until the end of your next turn, you have resistance against bludgeoning, piercing, and slashing damage dealt by weapon attacks."
        },
        {
            "name": "Dancing Lights",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a bit of phosphorus or wychwood, or a glowworm"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration."
        },
        {
            "name": "Friends",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn't hostile toward you. When the spell ends, the creature realizes that you used magic to influence its mood and may become hostile toward you."
        },
        {
            "name": "Light",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a firefly or phosphorescent moss"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet."
        },
        {
            "name": "Mage Hand",
            "school": "conjuration",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "1 minute",
            "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again."
        },
        {
            "name": "Mending",
            "school": "transmutation",
            "casting_time": "1 minute",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["two lodestones"],
                    "consumed": false
                }
            },
            "duration": "Instantaneous",
            "description": "This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin."
        },
        {
            "name": "Message",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a short piece of copper wire"],
                    "consumed": false
                }
            },
            "duration": "1 round",
            "description": "You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear."
        },
        {
            "name": "Minor Illusion",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "somatic": true,
                "material": {
                    "items": ["a bit of fleece"],
                    "consumed": false
                }
            },
            "duration": "1 minute",
            "description": "You create a sound or an image of an object within range that lasts for the duration. The illusion ends if you dismiss it as an action or cast this spell again."
        },
        {
            "name": "Prestidigitation",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "10 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Up to 1 hour",
            "description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of several minor magical effects within range."
        },
        {
            "name": "True Strike",
            "school": "divination",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 round",
            "description": "You point a finger at a target in range. Your magic grants you a brief insight into the target's defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn't ended."
        },
        {
            "name": "Vicious Mockery",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "You unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a Wisdom saving throw or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn."
        }
    ],
    "level_1": [
        {
            "name": "Animal Friendship",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a morsel of food"],
                    "consumed": false
                }
            },
            "duration": "24 hours",
            "description": "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration."
        },
        {
            "name": "Bane",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a drop of blood"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw."
        },
        {
            "name": "Charm Person",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "1 hour",
            "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you."
        },
        {
            "name": "Color Spray",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "Self (15-foot cone)",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a pinch of powder or sand that is colored red, yellow, and blue"],
                    "consumed": false
                }
            },
            "duration": "1 round",
            "description": "A dazzling array of flashing, colored light springs from your hand. Roll 6d10; the total is how many hit points of creatures this spell can affect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can't see)."
        },
        {
            "name": "Comprehend Languages",
            "school": "divination",
            "ritual": true,
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a pinch of soot and salt"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written."
        },
        {
            "name": "Cure Wounds",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
        },
        {
            "name": "Detect Magic",
            "school": "divination",
            "ritual": true,
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 10 minutes",
            "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any."
        },
        {
            "name": "Disguise Self",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "1 hour",
            "description": "You make yourself—including your clothing, armor, weapons, and other belongings on your person—look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The changes wrought by this spell fail to hold up to physical inspection."
        },
        {
            "name": "Dissonant Whispers",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "You whisper a discordant melody that only one creature of your choice within range can hear, wracking it with terrible pain. The target must make a Wisdom saving throw. On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn't move into obviously dangerous ground, such as a fire or a pit. On a successful save, the target takes half as much damage and doesn't have to move away."
        },
        {
            "name": "Faerie Fire",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Each object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice). Any creature in the area when the spell is cast is also outlined in light if it fails a Dexterity saving throw. For the duration, objects and affected creatures shed dim light in a 10-foot radius. Any attack roll against an affected creature or object has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible."
        },
        {
            "name": "Feather Fall",
            "school": "transmutation",
            "casting_time": "1 reaction",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": {
                    "items": ["a small feather or a piece of down"],
                    "consumed": false
                }
            },
            "duration": "1 minute",
            "description": "Choose up to five falling creatures within range. A falling creature's rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature."
        },
        {
            "name": "Healing Word",
            "school": "evocation",
            "casting_time": "1 bonus action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
        },
        {
            "name": "Heroism",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to being frightened and gains temporary hit points equal to your spellcasting ability modifier at the start of each of its turns."
        },
        {
            "name": "Identify",
            "school": "divination",
            "ritual": true,
            "casting_time": "1 minute",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a pearl worth 100 gp and an owl feather"],
                    "consumed": false
                }
            },
            "duration": "Instantaneous",
            "description": "You choose one object that you must touch throughout the casting of the spell. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any."
        },
        {
            "name": "Illusory Script",
            "school": "illusion",
            "ritual": true,
            "casting_time": "1 minute",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a lead-based ink worth at least 10 gp, which the spell consumes"],
                    "consumed": true
                }
            },
            "duration": "10 days",
            "description": "You write on parchment, paper, or some other suitable writing material and imbue it with a potent illusion that lasts for the duration."
        },
        {
            "name": "Longstrider",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a pinch of dirt"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "You touch a creature. The target's speed increases by 10 feet until the spell ends."
        },
        {
            "name": "Silent Image",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a bit of fleece"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 10 minutes",
            "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn't accompanied by sound, smell, or other sensory effects."
        },
        {
            "name": "Sleep",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "90 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a pinch of fine sand, rose petals, or a cricket"],
                    "consumed": false
                }
            },
            "duration": "1 minute",
            "description": "This spell sends creatures into a magical slumber. Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can't see)."
        },
        {
            "name": "Speak with Animals",
            "school": "divination",
            "ritual": true,
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "10 minutes",
            "description": "You gain the ability to comprehend and verbally communicate with beasts for the duration. The knowledge and awareness of many beasts is limited by their intelligence, but at minimum, beasts can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day."
        },
        {
            "name": "Tasha's Hideous Laughter",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["tiny tarts and a feather that is waved in the air"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "A creature of your choice that you can see within range perceives everything as hilariously funny and falls into fits of laughter if this spell affects it. The target must succeed on a Wisdom saving throw or fall prone, becoming incapacitated and unable to stand up for the duration."
        },
        {
            "name": "Thunderwave",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "Self (15-foot cube)",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed."
        },
        {
            "name": "Unseen Servant",
            "school": "conjuration",
            "ritual": true,
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a piece of string and a bit of wood"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "This spell creates an invisible, mindless, shapeless force that performs simple tasks at your command until the spell ends."
        }
    ],
    "level_2": [
        {
            "name": "Aid",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a tiny strip of white cloth"],
                    "consumed": false
                }
            },
            "duration": "8 hours",
            "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration."
        },
        {
            "name": "Animal Messenger",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a morsel of food"],
                    "consumed": false
                }
            },
            "duration": "24 hours",
            "description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description. You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals."
        },
        {
            "name": "Blindness/Deafness",
            "school": "necromancy",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "1 minute",
            "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends."
        },
        {
            "name": "Calm Emotions",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects: You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime. Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward."
        },
        {
            "name": "Cloud of Daggers",
            "school": "conjuration",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a sliver of glass"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell's area for the first time on a turn or starts its turn there."
        },
        {
            "name": "Crown of Madness",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes. The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose."
        },
        {
            "name": "Detect Thoughts",
            "school": "divination",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a copper piece"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn't speak any language, the creature is unaffected."
        },
        {
            "name": "Enhance Ability",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["fur or a feather from a beast"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 hour",
            "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends: Bear's Endurance, Bull's Strength, Cat's Grace, Eagle's Splendor, Fox's Cunning, or Owl's Wisdom."
        },
        {
            "name": "Enthrall",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "1 minute",
            "description": "You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a Wisdom saving throw. Any creature that can't be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you."
        },
        {
            "name": "Heat Metal",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a piece of iron and a flame"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again."
        },
        {
            "name": "Hold Person",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."
        },
        {
            "name": "Invisibility",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["an eyelash encased in gum arabic"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 hour",
            "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell."
        },
        {
            "name": "Knock",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "Choose a locked, barred, or stuck object that you can see within range. A target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred. If the object has multiple locks, only one of them is unlocked."
        },
        {
            "name": "Lesser Restoration",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned."
        },
        {
            "name": "Locate Animals or Plants",
            "school": "divination",
            "ritual": true,
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a bit of fur from a hunting dog"],
                    "consumed": false
                }
            },
            "duration": "Instantaneous",
            "description": "Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present."
        },
        {
            "name": "Locate Object",
            "school": "divination",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a forked twig"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 10 minutes",
            "description": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement."
        },
        {
            "name": "Magic Mouth",
            "school": "illusion",
            "ritual": true,
            "casting_time": "1 minute",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a small bit of honeycomb and jade dust worth at least 10 gp"],
                    "consumed": true
                }
            },
            "duration": "Until dispelled",
            "description": "You implant a message within an object in range, a message that is uttered when a trigger condition is met. Choose an object that you can see and that isn't being worn or carried by another creature. Then speak the message, which must be 25 words or less, though it can be delivered over as long as 10 minutes."
        },
        {
            "name": "Mirror Image",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "1 minute",
            "description": "Three illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it's impossible to track which image is real. You can use your action to dismiss the illusory duplicates."
        },
        {
            "name": "Phantasmal Force",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a bit of fleece"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You craft an illusion that takes root in the mind of a creature that you can see within range. The target must make an Intelligence saving throw. On a failed save, you create a phantasmal illusion that only the target can see, hear, and feel."
        },
        {
            "name": "See Invisibility",
            "school": "divination",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a pinch of talc and a small sprinkling of powdered silver"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "For the duration, you see invisible creatures and objects as if they were visible, and you can see into the Ethereal Plane. Ethereal creatures and objects appear ghostly and translucent."
        },
        {
            "name": "Shatter",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a chip of mica"],
                    "consumed": false
                }
            },
            "duration": "Instantaneous",
            "description": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one."
        },
        {
            "name": "Silence",
            "school": "illusion",
            "ritual": true,
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 10 minutes",
            "description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it."
        },
        {
            "name": "Suggestion",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": {
                    "items": ["a snake's tongue and either a bit of honeycomb or a drop of sweet oil"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 8 hours",
            "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable."
        },
        {
            "name": "Zone of Truth",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "10 minutes",
            "description": "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius."
        }
    ],
    "level_3": [
        {
            "name": "Bestow Curse",
            "school": "necromancy",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options: Choose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score. While cursed, the target has disadvantage on attack rolls against you. While cursed, the target must make a Wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing. While the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target."
        },
        {
            "name": "Clairvoyance",
            "school": "divination",
            "casting_time": "10 minutes",
            "range": "1 mile",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a focus worth at least 100 gp, either a jeweled horn for hearing or a glass eye for seeing"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 10 minutes",
            "description": "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can't be attacked or otherwise interacted with."
        },
        {
            "name": "Dispel Magic",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends."
        },
        {
            "name": "Fear",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "Self (30-foot cone)",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a white feather or the heart of a hen"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You project a phantasmal image of a creature's worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration. While frightened by this spell, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move."
        },
        {
            "name": "Glyph of Warding",
            "school": "abjuration",
            "casting_time": "1 hour",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["incense and powdered diamond worth at least 200 gp"],
                    "consumed": true
                }
            },
            "duration": "Until dispelled or triggered",
            "description": "When you cast this spell, you inscribe a glyph that later unleashes a magical effect. You inscribe it either on a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph."
        },
        {
            "name": "Hypnotic Pattern",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a glowing stick of incense or a crystal vial filled with phosphorescent material"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a Wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0."
        },
        {
            "name": "Major Image",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a bit of fleece"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 10 minutes",
            "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted."
        },
        {
            "name": "Nondetection",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a pinch of diamond dust worth 25 gp"],
                    "consumed": true
                }
            },
            "duration": "8 hours",
            "description": "For the duration, you hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension. The target can't be targeted by any divination magic or perceived through magical scrying sensors."
        },
        {
            "name": "Plant Growth",
            "school": "transmutation",
            "casting_time": "1 action or 8 hours",
            "range": "150 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits. If you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot radius centered on that point become thick and overgrown. If you cast this spell over 8 hours, you enrich the land."
        },
        {
            "name": "Sending",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "Unlimited",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a short piece of fine copper wire"],
                    "consumed": false
                }
            },
            "duration": "1 round",
            "description": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately."
        },
        {
            "name": "Speak with Dead",
            "school": "necromancy",
            "casting_time": "1 action",
            "range": "10 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["burning incense"],
                    "consumed": false
                }
            },
            "duration": "10 minutes",
            "description": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead. The spell fails if the corpse was the target of this spell within the last 10 days."
        },
        {
            "name": "Speak with Plants",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "Self (30-foot radius)",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "10 minutes",
            "description": "You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances."
        },
        {
            "name": "Stinking Cloud",
            "school": "conjuration",
            "casting_time": "1 action",
            "range": "90 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a rotten egg or several skunk cabbage leaves"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration. Each creature that starts its turn in the cloud must make a Constitution saving throw against poison."
        },
        {
            "name": "Tiny Hut",
            "school": "evocation",
            "ritual": true,
            "casting_time": "1 minute",
            "range": "Self (10-foot-radius hemisphere)",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a small crystal bead"],
                    "consumed": false
                }
            },
            "duration": "8 hours",
            "description": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area. Nine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures."
        },
        {
            "name": "Tongues",
            "school": "divination",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a small clay model of a ziggurat"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says."
        }
    ],
    "level_4": [
        {
            "name": "Compulsion",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Creatures of your choice that you can see within range and that can hear you must make a Wisdom saving throw. A target automatically succeeds on this saving throw if it can't be charmed. On a failed save, a target is affected by this spell. Until the spell ends, you can use a bonus action on each of your turns to designate a direction that is horizontal to you. Each affected target must use as much of its movement as possible to move in that direction on its next turn."
        },
        {
            "name": "Confusion",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "90 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["three nut shells"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "This spell assaults and twists creatures' minds, spawning delusions and provoking uncontrolled action. Each creature in a 10-foot-radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it. An affected target can't take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn."
        },
        {
            "name": "Dimension Door",
            "school": "conjuration",
            "casting_time": "1 action",
            "range": "500 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as '200 feet straight downward' or 'upward to the northwest at a 45-degree angle, 300 feet.'"
        },
        {
            "name": "Freedom of Movement",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a leather strap, bound around the arm or a similar appendage"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained. The target can also spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled."
        },
        {
            "name": "Greater Invisibility",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person."
        },
        {
            "name": "Hallucinatory Terrain",
            "school": "illusion",
            "casting_time": "10 minutes",
            "range": "300 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a stone, a twig, and a bit of green plant"],
                    "consumed": false
                }
            },
            "duration": "24 hours",
            "description": "You make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road."
        },
        {
            "name": "Locate Creature",
            "school": "divination",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a bit of fur from a bloodhound"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 hour",
            "description": "Describe or name a creature that is familiar to you. You sense the direction to the creature's location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement. The spell can locate a specific creature known to you, or the nearest creature of a specific kind (such as a human or a unicorn), so long as you have seen such a creature up close—within 30 feet—at least once."
        },
        {
            "name": "Polymorph",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a caterpillar cocoon"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 hour",
            "description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. The spell has no effect on a shapechanger or a creature with 0 hit points. The transformation lasts for the duration, or until the target drops to 0 hit points or dies."
        }
    ],
    "level_5": [
        {
            "name": "Animate Objects",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can't animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points."
        },
        {
            "name": "Awaken",
            "school": "transmutation",
            "casting_time": "8 hours",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["an agate worth at least 1,000 gp"],
                    "consumed": true
                }
            },
            "duration": "Instantaneous",
            "description": "After spending the casting time tracing magical pathways within a precious gemstone, you touch a Huge or smaller beast or plant. The target must have either no Intelligence score or an Intelligence of 3 or less. The target gains an Intelligence of 10. The target also gains the ability to speak one language you know. If the target is a plant, it gains the ability to move its limbs, roots, vines, creepers, and so forth, and it gains senses similar to a human's."
        },
        {
            "name": "Dominate Person",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You attempt to beguile a humanoid that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw. While the target is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence."
        },
        {
            "name": "Dream",
            "school": "illusion",
            "casting_time": "1 minute",
            "range": "Special",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a handful of sand, a dab of ink, and a writing quill plucked from a sleeping bird"],
                    "consumed": false
                }
            },
            "duration": "8 hours",
            "description": "This spell shapes a creature's dreams. Choose a creature known to you as the target of this spell. The target must be on the same plane of existence as you. Creatures that don't sleep, such as elves, can't be contacted by this spell. You, or a willing creature you touch, enters a trance state, acting as a messenger."
        },
        {
            "name": "Geas",
            "school": "enchantment",
            "casting_time": "1 minute",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "30 days",
            "description": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide. If the creature can understand you, it must succeed on a Wisdom saving throw or become charmed by you for the duration. While the creature is charmed by you, it takes 5d10 psychic damage each time it acts in a manner directly counter to your instructions."
        },
        {
            "name": "Greater Restoration",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["diamond dust worth at least 100 gp"],
                    "consumed": true
                }
            },
            "duration": "Instantaneous",
            "description": "You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target's exhaustion level by one, or end one of the following effects on the target: one effect that charmed or petrified the target, one curse, including the target's attunement to a cursed magic item, any reduction to one of the target's ability scores, or one effect reducing the target's hit point maximum."
        },
        {
            "name": "Hold Monster",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "90 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a small, straight piece of iron"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. This spell has no effect on undead. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."
        },
        {
            "name": "Legend Lore",
            "school": "divination",
            "casting_time": "10 minutes",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["incense worth at least 250 gp, which the spell consumes, and four ivory strips worth at least 50 gp each"],
                    "consumed": true
                }
            },
            "duration": "Instantaneous",
            "description": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known. If the thing you named isn't of legendary importance, you gain no information."
        },
        {
            "name": "Mass Cure Wounds",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
        },
        {
            "name": "Mislead",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 hour",
            "description": "You become invisible at the same time that an illusory double of you appears where you are standing. The double lasts for the duration, but the invisibility ends if you attack or cast a spell. You can use your action to move your illusory double up to twice your speed and make it gesture, speak, and behave in whatever way you choose."
        },
        {
            "name": "Modify Memory",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "You attempt to reshape another creature's memories. One creature that you can see must make a Wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you."
        },
        {
            "name": "Planar Binding",
            "school": "abjuration",
            "casting_time": "1 hour",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a jewel worth at least 1,000 gp"],
                    "consumed": true
                }
            },
            "duration": "24 hours",
            "description": "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service. The creature must be within range for the entire casting of the spell. At the completion of the casting, the target must make a Charisma saving throw. On a failed save, it is bound to serve you for the duration."
        },
        {
            "name": "Raise Dead",
            "school": "necromancy",
            "casting_time": "1 hour",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a diamond worth at least 500 gp"],
                    "consumed": true
                }
            },
            "duration": "Instantaneous",
            "description": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point. This spell also neutralizes any poisons and cures nonmagical diseases that affected the creature at the time it died."
        },
        {
            "name": "Scrying",
            "school": "divination",
            "casting_time": "10 minutes",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 10 minutes",
            "description": "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a Wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you're casting this spell, it can fail the saving throw voluntarily if it wants to be observed."
        },
        {
            "name": "Seeming",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "8 hours",
            "description": "This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a Charisma saving throw, and if it succeeds, it is unaffected by this spell."
        },
        {
            "name": "Teleportation Circle",
            "school": "conjuration",
            "casting_time": "1 minute",
            "range": "10 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["rare chalks and inks infused with precious gems worth 50 gp"],
                    "consumed": true
                }
            },
            "duration": "1 round",
            "description": "As you cast the spell, you draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence as you."
        }
    ],
    "level_6": [
        {
            "name": "Eyebite",
            "school": "necromancy",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "For the spell's duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a Wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can't target a creature again if it has succeeded on a saving throw against this casting of eyebite: Asleep, Panicked, or Sickened."
        },
        {
            "name": "Find the Path",
            "school": "divination",
            "casting_time": "1 minute",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a set of divinatory tools—such as bones, ivory sticks, cards, teeth, or carved runes—worth 100 gp and an object from the location you wish to find"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 day",
            "description": "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence. If you name a destination on another plane of existence, a destination that moves (such as a mobile fortress), or a destination that isn't specific (such as 'a green dragon's lair'), the spell fails."
        },
        {
            "name": "Guards and Wards",
            "school": "abjuration",
            "casting_time": "10 minutes",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["burning incense, a small measure of brimstone and oil, a knotted string, a small amount of umber hulk blood, and a small silver rod worth at least 10 gp"],
                    "consumed": false
                }
            },
            "duration": "24 hours",
            "description": "You create a ward that protects up to 2,500 square feet of floor space (an area 50 feet square, or one hundred 5-foot squares or twenty-five 10-foot squares). The warded area can be up to 20 feet tall, and shaped as you desire. You can ward several stories of a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell."
        },
        {
            "name": "Mass Suggestion",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a snake's tongue and either a bit of honeycomb or a drop of sweet oil"],
                    "consumed": false
                }
            },
            "duration": "24 hours",
            "description": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable."
        },
        {
            "name": "Otto's Irresistible Dance",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Concentration, up to 1 minute",
            "description": "Choose one creature that you can see within range. The target begins a comic dance in place: shuffling, tapping its feet, and capering for the duration. Creatures that can't be charmed are immune to this spell. A dancing creature must use all its movement to dance without leaving its space and has disadvantage on Dexterity saving throws and attack rolls."
        },
        {
            "name": "Programmed Illusion",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "120 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a bit of fleece and jade dust worth at least 25 gp"],
                    "consumed": false
                }
            },
            "duration": "Until dispelled",
            "description": "You create an illusion of an object, a creature, or some other visible phenomenon within range that activates when a specific condition occurs. The illusion is imperceptible until then. It must be no larger than a 30-foot cube, and you decide when you cast the spell how the illusion behaves and what sounds it makes."
        },
        {
            "name": "True Seeing",
            "school": "divination",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["an ointment for the eyes that costs 25 gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell"],
                    "consumed": true
                }
            },
            "duration": "1 hour",
            "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."
        }
    ],
    "level_7": [
        {
            "name": "Etherealness",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Up to 8 hours",
            "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away."
        },
        {
            "name": "Forcecage",
            "school": "evocation",
            "casting_time": "1 action",
            "range": "100 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["ruby dust worth 1,500 gp"],
                    "consumed": true
                }
            },
            "duration": "1 hour",
            "description": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box, as you choose. A prison in the shape of a cage can be up to 20 feet on a side and is made from 1/2-inch diameter bars spaced 1/2 inch apart. A prison in the shape of a box can be up to 10 feet on a side, creating a solid barrier that prevents any matter from passing through it and blocking any spells cast into or out from the area."
        },
        {
            "name": "Magnificent Mansion",
            "school": "conjuration",
            "casting_time": "1 minute",
            "range": "300 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a miniature portal carved from ivory, a small piece of polished marble, and a tiny silver spoon, each item worth at least 5 gp"],
                    "consumed": false
                }
            },
            "duration": "24 hours",
            "description": "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located. The entrance shimmers faintly and is 5 feet wide and 10 feet tall. You and any creature you designate when you cast the spell can enter the extradimensional dwelling as long as the portal remains open. You can open or close the portal if you are within 30 feet of it. While closed, the portal is invisible."
        },
        {
            "name": "Mirage Arcane",
            "school": "illusion",
            "casting_time": "10 minutes",
            "range": "Sight",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "10 days",
            "description": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. The terrain's general shape remains the same, however. Open fields or a road could be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road."
        },
        {
            "name": "Project Image",
            "school": "illusion",
            "casting_time": "1 action",
            "range": "500 miles",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a small replica of you made from materials worth at least 5 gp"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 day",
            "description": "You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location within range that you have seen before, regardless of intervening obstacles. The illusion looks and sounds like you but is intangible. If the illusion takes any damage, it disappears, and the spell ends."
        },
        {
            "name": "Regenerate",
            "school": "transmutation",
            "casting_time": "1 minute",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a prayer wheel and holy water"],
                    "consumed": false
                }
            },
            "duration": "1 hour",
            "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute). The target's severed body members (fingers, legs, tails, and so on), if any, are restored after 2 minutes. If you have the severed part and hold it to the stump, the spell instantaneously causes the limb to knit to the stump."
        },
        {
            "name": "Resurrection",
            "school": "necromancy",
            "casting_time": "1 hour",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a diamond worth at least 1,000 gp"],
                    "consumed": true
                }
            },
            "duration": "Instantaneous",
            "description": "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't undead. If its soul is free and willing, the target returns to life with all its hit points. This spell neutralizes any poisons and cures normal diseases afflicting the creature when it died. It doesn't, however, remove magical diseases, curses, and the like; if such effects aren't removed prior to casting the spell, they afflict the target on its return to life."
        },
        {
            "name": "Symbol",
            "school": "abjuration",
            "casting_time": "1 minute",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp"],
                    "consumed": true
                }
            },
            "duration": "Until dispelled or triggered",
            "description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."
        },
        {
            "name": "Teleport",
            "school": "conjuration",
            "casting_time": "1 action",
            "range": "10 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can't be held or carried by an unwilling creature."
        }
    ],
    "level_8": [
        {
            "name": "Dominate Monster",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "Concentration, up to 1 hour",
            "description": "You attempt to beguile a creature that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw. While the creature is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey."
        },
        {
            "name": "Feeblemind",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "150 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a handful of clay, crystal, glass, or mineral spheres"],
                    "consumed": false
                }
            },
            "duration": "Instantaneous",
            "description": "You blast the mind of a creature that you can see within range, attempting to shatter its intellect and personality. The target takes 4d6 psychic damage and must make an Intelligence saving throw. On a failed save, the creature's Intelligence and Charisma scores become 1. The creature can't cast spells, activate magic items, understand language, or communicate in any intelligible way. The creature can, however, identify its friends, follow them, and even protect them."
        },
        {
            "name": "Glibness",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "Self",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "1 hour",
            "description": "Until the spell ends, when you make a Charisma check, you can replace the number you roll with a 15. Additionally, no matter what you say, magic that would determine if you are telling the truth indicates that you are being truthful."
        },
        {
            "name": "Mind Blank",
            "school": "abjuration",
            "casting_time": "1 action",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": false
            },
            "duration": "24 hours",
            "description": "Until the spell ends, one willing creature you touch is immune to psychic damage, any effect that would sense its emotions or read its thoughts, divination spells, and the charmed condition. Even wish spell can't gain information about the target or make it take an action."
        },
        {
            "name": "Power Word Stun",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "You speak a word of power that can overwhelm the mind of one creature you can see within range, leaving it dumbfounded. If the target has 150 hit points or fewer, it is stunned. Otherwise, the spell has no effect. The stunned target must make a Constitution saving throw at the end of each of its turns. On a successful save, this stunning effect ends."
        }
    ],
    "level_9": [
        {
            "name": "Foresight",
            "school": "divination",
            "casting_time": "1 minute",
            "range": "Touch",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a hummingbird feather"],
                    "consumed": false
                }
            },
            "duration": "8 hours",
            "description": "You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target can't be surprised and has advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls against the target for the duration. This spell immediately ends if you cast it again before its duration ends."
        },
        {
            "name": "Power Word Kill",
            "school": "enchantment",
            "casting_time": "1 action",
            "range": "60 feet",
            "components": {
                "verbal": true,
                "somatic": false,
                "material": false
            },
            "duration": "Instantaneous",
            "description": "You utter a word of power that can compel one creature you can see within range to die instantly. If the creature you choose has 100 hit points or fewer, it dies. Otherwise, the spell has no effect."
        },
        {
            "name": "True Polymorph",
            "school": "transmutation",
            "casting_time": "1 action",
            "range": "30 feet",
            "components": {
                "verbal": true,
                "somatic": true,
                "material": {
                    "items": ["a drop of mercury, a dollop of gum arabic, and a wisp of smoke"],
                    "consumed": false
                }
            },
            "duration": "Concentration, up to 1 hour",
            "description": "Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into a nonmagical object, or the object into a creature (the object must be neither worn nor carried by another creature). The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation lasts until it is dispelled."
        }
    ]
}