{
    "name": "Entertainer",
    "description": "You thrive in front of an audience. You know how to entrance them, entertain them, and even inspire them.",
    "feature": {
        "name": "By Popular Demand",
        "description": "You can always find a place to perform, usually in an inn or tavern but possibly with a circus, at a theater, or even in a noble's court. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you."
    },
    "proficiency_grants": {
        "skills": [
            "Acrobatics",
            "Performance"
        ],
        "languages": [],
        "tools": [
            {
                "type": "disguise kit",
                "quantity": 1
            },
            {
                "type": "musical instrument",
                "quantity": 1,
                "description": "One type of musical instrument"
            }
        ]
    },
    "equipment_grants": {
        "fixed": [
            {
                "item": "Musical Instrument",
                "quantity": 1,
                "description": "A musical instrument of your choice"
            },
            {
                "item": "Admirer's Favor",
                "quantity": 1,
                "description": "The favor of an admirer (love letter, lock of hair, or trinket)"
            },
            {
                "item": "Costume",
                "quantity": 1,
                "description": "A costume"
            }
        ],
        "currency": {
            "gold": 15
        }
    },
    "personality": {
        "personality_traits": {
            "suggestions": [
                "I know a story relevant to almost every situation.",
                "Whenever I come to a new place, I collect local rumors and spread gossip.",
                "I'm a hopeless romantic, always searching for that 'special someone.'",
                "Nobody stays angry at me or around me for long, since I can defuse any amount of tension.",
                "I love a good insult, even one directed at me.",
                "I get bitter if I'm not the center of attention.",
                "I'll settle for nothing less than perfection.",
                "I change my mood or my mind as quickly as I change key in a song."
            ],
            "count": 2,
            "type": "choice"
        },
        "ideals": {
            "suggestions": [
                {
                    "ideal": "Beauty. When I perform, I make the world better than it was.",
                    "alignment": "Good"
                },
                {
                    "ideal": "Tradition. The stories, legends, and songs of the past must never be forgotten, for they teach us who we are.",
                    "alignment": "Lawful"
                },
                {
                    "ideal": "Creativity. The world is in need of new ideas and bold action.",
                    "alignment": "Chaotic"
                },
                {
                    "ideal": "Greed. I'm only in it for the money and fame.",
                    "alignment": "Evil"
                },
                {
                    "ideal": "People. I like seeing the smiles on people's faces when I perform. That's all that matters.",
                    "alignment": "Neutral"
                },
                {
                    "ideal": "Honesty. Art should reflect the soul; it should come from within and reveal who we really are.",
                    "alignment": "Any"
                }
            ],
            "count": 1,
            "type": "choice"
        },
        "bonds": {
            "suggestions": [
                "My instrument is my most treasured possession, and it reminds me of someone I love.",
                "Someone stole my precious instrument, and someday I'll get it back.",
                "I want to be famous, whatever it takes.",
                "I idolize a hero of the old tales and measure my deeds against that person's.",
                "I will do anything to prove myself superior to my hated rival.",
                "I would do anything for the other members of my old troupe."
            ],
            "count": 1,
            "type": "choice"
        },
        "flaws": {
            "suggestions": [
                "I'll do anything to win fame and renown.",
                "I'm a sucker for a pretty face.",
                "A scandal prevents me from ever going home again. That kind of trouble seems to follow me around.",
                "I once satirized a noble who still wants my head. It was a mistake that I will likely repeat.",
                "I have trouble keeping my true feelings hidden. My sharp tongue lands me in trouble.",
                "Despite my best efforts, I am unreliable to my friends."
            ],
            "count": 1,
            "type": "choice"
        }
    },
    "suggested_characteristics": "Successful entertainers have to be able to capture and hold an audience's attention, so they tend to have flamboyant or forceful personalities. They're inclined toward the romantic and often cling to high-minded ideals about the practice of art and the appreciation of beauty."
} 