{
    "name": "Outlander",
    "description": "You grew up in the wilds, far from civilization and the comforts of town and technology. You've witnessed the migration of herds larger than forests, survived weather more extreme than any city-dweller could comprehend, and enjoyed the solitude of being the only thinking creature for miles in any direction.",
    "feature": {
        "name": "Wanderer",
        "description": "You have an excellent memory for maps and geography, and you can always recall the general layout of terrain, settlements, and other features around you. In addition, you can find food and shelter for yourself and up to five other people each day, provided that the land offers berries, small game, water, and so forth. The food and shelter you provide is only sufficient for basic survival, but it's enough to maintain your group's health for as long as necessary."
    },
    "proficiency_grants": {
        "skills": [
            "Athletics",
            "Survival"
        ],
        "languages": {
            "count": 1,
            "type": "choice",
            "description": "One language of your choice"
        },
        "tools": [
            {
                "type": "musical instrument",
                "quantity": 1,
                "description": "One type of musical instrument"
            }
        ]
    },
    "equipment_grants": {
        "fixed": [
            {
                "item": "Staff",
                "quantity": 1,
                "description": "A staff"
            },
            {
                "item": "Hunting Trap",
                "quantity": 1,
                "description": "A hunting trap"
            },
            {
                "item": "Traveler's Clothes",
                "quantity": 1,
                "description": "A set of traveler's clothes"
            },
            {
                "item": "Belt Pouch",
                "quantity": 1,
                "description": "A belt pouch"
            }
        ],
        "currency": {
            "gold": 10
        }
    },
    "personality": {
        "personality_traits": {
            "suggestions": [
                "I'm driven by a wanderlust that led me away from home.",
                "I watch over my friends as if they were a litter of newborn pups.",
                "I once ran twenty-five miles without stopping to warn to my clan of an approaching orc horde. I'd do it again if I had to.",
                "I have a lesson for every situation, drawn from observing nature.",
                "I place no stock in wealthy or well-mannered folk. Money and manners won't save you from a hungry owlbear.",
                "I'm always picking things up, absently fiddling with them, and sometimes accidentally breaking them.",
                "I feel far more comfortable around animals than people.",
                "I was, in fact, raised by wolves."
            ],
            "count": 2,
            "type": "choice"
        },
        "ideals": {
            "suggestions": [
                {
                    "ideal": "Change. Life is like the seasons, in constant change, and we must change with it.",
                    "alignment": "Chaotic"
                },
                {
                    "ideal": "Greater Good. It is each person's responsibility to make the most happiness for the whole tribe.",
                    "alignment": "Good"
                },
                {
                    "ideal": "Honor. If I dishonor myself, I dishonor my whole clan.",
                    "alignment": "Lawful"
                },
                {
                    "ideal": "Might. The strongest are meant to rule.",
                    "alignment": "Evil"
                },
                {
                    "ideal": "Nature. The natural world is more important than all the constructs of civilization.",
                    "alignment": "Neutral"
                },
                {
                    "ideal": "Glory. I must earn glory in battle, for myself and my clan.",
                    "alignment": "Any"
                }
            ],
            "count": 1,
            "type": "choice"
        },
        "bonds": {
            "suggestions": [
                "My family, clan, or tribe is the most important thing in my life, even when they are far from me.",
                "An injury to the unspoiled wilderness of my home is an injury to me.",
                "I will bring terrible wrath down on the evildoers who destroyed my homeland.",
                "I am the last of my tribe, and it is up to me to ensure their names enter legend.",
                "I suffer awful visions of a coming disaster and will do anything to prevent it.",
                "It is my duty to provide children to sustain my tribe."
            ],
            "count": 1,
            "type": "choice"
        },
        "flaws": {
            "suggestions": [
                "I am too enamored of ale, wine, and other intoxicants.",
                "There's no room for caution in a life lived to the fullest.",
                "I remember every insult I've received and nurse a silent resentment toward anyone who's ever wronged me.",
                "I am slow to trust members of other races, tribes, and societies.",
                "Violence is my answer to almost any challenge.",
                "Don't expect me to save those who can't save themselves. It is nature's way that the strong thrive and the weak perish."
            ],
            "count": 1,
            "type": "choice"
        }
    },
    "suggested_characteristics": "Often considered rude and uncouth among civilized folk, outlanders have little respect for the niceties of life in the cities. The ties of tribe, clan, family, and the natural world of which they are a part are the most important bonds to most outlanders."
} 