{
    "name": "Sailor",
    "description": "You sailed on a seagoing vessel for years. In that time, you faced down mighty storms, monsters of the deep, and those who wanted to sink your craft to the bottomless depths.",
    "feature": {
        "name": "Ship's Passage",
        "description": "When you need to, you can secure free passage on a sailing ship for yourself and your adventuring companions. You might sail on the ship you served on, or another ship you have good relations with (perhaps one captained by a former crewmate). Because you're calling in a favor, you can't be certain of a schedule or route that will meet your every need. Your Dungeon Master will determine how long it takes to get where you want to go. In return for your free passage, you and your companions are expected to assist the crew during the voyage."
    },
    "proficiency_grants": {
        "skills": [
            "Athletics",
            "Perception"
        ],
        "languages": [],
        "tools": [
            {
                "type": "navigator's tools",
                "quantity": 1
            },
            {
                "type": "vehicles (water)",
                "quantity": 1
            }
        ]
    },
    "equipment_grants": {
        "fixed": [
            {
                "item": "Belaying Pin",
                "quantity": 1,
                "description": "A belaying pin (club)"
            },
            {
                "item": "Silk Rope",
                "quantity": 1,
                "description": "50 feet of silk rope"
            },
            {
                "item": "Lucky Charm",
                "quantity": 1,
                "description": "A lucky charm such as a rabbit foot or a small stone with a hole in the center"
            },
            {
                "item": "Common Clothes",
                "quantity": 1,
                "description": "A set of common clothes"
            }
        ],
        "currency": {
            "gold": 10
        }
    },
    "personality": {
        "personality_traits": {
            "suggestions": [
                "My friends know they can rely on me, no matter what.",
                "I work hard so that I can play hard when the work is done.",
                "I enjoy sailing into new ports and making new friends over a flagon of ale.",
                "I stretch the truth for the sake of a good story.",
                "To me, a tavern brawl is a nice way to get to know a new city.",
                "I never pass up a friendly wager.",
                "My language is as foul as an otyugh nest.",
                "I like a job well done, especially if I can convince someone else to do it."
            ],
            "count": 2,
            "type": "choice"
        },
        "ideals": {
            "suggestions": [
                {
                    "ideal": "Respect. The thing that keeps a ship together is mutual respect between captain and crew.",
                    "alignment": "Good"
                },
                {
                    "ideal": "Fairness. We all do the work, so we all share in the rewards.",
                    "alignment": "Lawful"
                },
                {
                    "ideal": "Freedom. The sea is freedom—the freedom to go anywhere and do anything.",
                    "alignment": "Chaotic"
                },
                {
                    "ideal": "Mastery. I'm a predator, and the other ships on the sea are my prey.",
                    "alignment": "Evil"
                },
                {
                    "ideal": "People. I'm committed to my crewmates, not to ideals.",
                    "alignment": "Neutral"
                },
                {
                    "ideal": "Aspiration. Someday I'll own my own ship and chart my own destiny.",
                    "alignment": "Any"
                }
            ],
            "count": 1,
            "type": "choice"
        },
        "bonds": {
            "suggestions": [
                "I'm loyal to my captain first, everything else second.",
                "The ship is most important—crewmates and captains come and go.",
                "I'll always remember my first ship.",
                "In a harbor town, I have a paramour whose eyes nearly stole me from the sea.",
                "I was cheated out of my fair share of the profits, and I want to get my due.",
                "Ruthless pirates murdered my captain and crewmates, plundered our ship, and left me to die. Vengeance will be mine."
            ],
            "count": 1,
            "type": "choice"
        },
        "flaws": {
            "suggestions": [
                "I follow orders, even if I think they're wrong.",
                "I'll say anything to avoid having to do extra work.",
                "Once someone questions my courage, I never back down no matter how dangerous the situation.",
                "Once I start drinking, it's hard for me to stop.",
                "I can't help but pocket loose coins and other trinkets I come across.",
                "My pride will probably lead to my destruction."
            ],
            "count": 1,
            "type": "choice"
        }
    },
    "suggested_characteristics": "Sailors can be a rough lot, but the responsibilities of life on a ship make them generally reliable as well. Life aboard a ship shapes their outlook and forms their most important attachments."
} 